---
kind: property
id: P:Autodesk.Revit.UI.UIThemeManager.CurrentCanvasTheme
source: html/2781557c-986e-5bec-0762-97ae790903d4.htm
---
# Autodesk.Revit.UI.UIThemeManager.CurrentCanvasTheme Property

current canvas theme.

## Syntax (C#)
```csharp
public static UITheme CurrentCanvasTheme { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration